In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
import datetime
import os

In [4]:
!type "..\pydata-book\examples\ex1.csv"

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
%pwd

'e:\\jupyter\\pandas_zj'

In [2]:
ex_path = r'..\pydata-book\examples'

In [9]:
file1 = os.path.join(ex_path,'ex1.csv')

In [10]:
file1

'..\\pydata-book\\examples\\ex1.csv'

In [11]:
df1 = pd.read_csv(file1)

In [12]:
df1.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
df1 = pd.read_table(file1,sep = ',',names = [str(x) for x in 'abcde'],skiprows = 0)
#应该使用names参数而不是headers参数，headers参数仅接受数字

In [20]:
df1

   a   b   c   d        e
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [23]:
file3 = os.path.join(ex_path,'ex3.txt')

In [25]:
df3 = pd.read_table(file3,sep = '\s+')
#sep 可以借书证这表达式

In [26]:
df3

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [31]:
df5 = pd.read_csv(os.path.join(ex_path,'ex5.csv'),na_values = ['Null','two'])
#可用一个字典表达

In [32]:
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

#### chunksize参数
> 迭代

In [50]:
df6 = pd.read_csv(os.path.join(ex_path,'ex6.csv'),chunksize=1000)

df6

s1 = Series([])

for x in df6:
    s1 = s1.add(x['key'].value_counts(),fill_value=0)

s1.sort_values(ascending = True,inplace = True)

s1

### to_csv方法
> 是在Series、DataFrame实例中

In [56]:
import sys

In [58]:
df1.to_csv(sys.stdout,':')

:a:b:c:d:e
0:a:b:c:d:message
1:1:2:3:4:hello
2:5:6:7:8:world
3:9:10:11:12:foo

### 使用python中的csv模块

## JSON数据

In [59]:
import json

In [60]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

**通过loads、dumps方法在json和python对象之间相互转换**

In [61]:
result = json.loads(obj)

In [62]:
result['name']

'Wes'

In [64]:
result['siblings'][1]

{'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}

In [66]:
df3 = DataFrame(result['siblings'],columns = ['name','age','pets'])

In [67]:
df3

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

#### 使用pd.read_json()方法
>输出使用to_json(）方法

## XML和HTML：Web信息收集
>pandas.read_html有一些选项，默认条件下，它会搜索、尝试解析<table>标签内的的表格数据。结果是一个列表的DataFrame对象：

In [3]:
import html5lib
df_html = pd.read_html(os.path.join(ex_path,'fdic_failed_bank_list.html'),flavor = 'bs4')

In [6]:
df_html[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

统计按年发生的次数

In [7]:
df_html = df_html[0]

In [11]:
close_time = pd.to_datetime(df_html['Closing Date'])

In [14]:
close_time.dt.year.value_counts().sort_index()

2000      2
2001      4
2002     11
2003      3
2004      4
2007      3
2008     25
2009    140
2010    157
2011     92
2012     51
2013     24
2014     18
2015      8
2016      5
Name: Closing Date, dtype: int64

## 读取Microsoft Excel文件

In [17]:
df_excel = pd.read_excel(os.path.join(ex_path,'ex1.xlsx'))

In [18]:
df_excel

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo